{
  "auto_mapping": null,
  "base_model_name_or_path": "../models/wisdom-ansible-v11.4.4/model_20230523-1/checkpoint",
  "inference_mode": true,
  "num_attention_heads": 16,
  "num_layers": 20,
  "num_ranks": 1,
  "num_tasks": 1,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 10,
  "peft_type": "MULTITASK_PROMPT_TUNING",
  "prompt_tuning_init": "RANDOM",
  "prompt_tuning_init_state_dict_path": null,
  "prompt_tuning_init_task": 0,
  "prompt_tuning_init_text": null,
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 1024,
  "tokenizer_name_or_path": "../models/wisdom-ansible-v11.4.4/model_20230523-1/checkpoint"
}